app/controllers/registrations_controller.rb

  def index
    render :json => Registration.all
---
SELECT `registrations`.* FROM `registrations`

  def create
    logger.info params
    r = Registration.new params[:registration]
    r.save
---
INSERT INTO `registrations` (`addl_donation`, `address`, `age`, `checkin_time`, `city`, `email`, `emergency_contact`, `emergency_phone`, `first_name`, `gender`, `is_family`, `last_name`, `payment`, `phone`, `reg_date`, `return_time`, `ride`, `shirt_size`, `state`, `zip`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    params[:registration][:checkin_time] = Time.now.strftime("%I:%M:%S") if params[:registration][:checkin_time] == 1
    params[:registration][:return_time] = Time.now.strftime("%I:%M:%S") if params[:registration][:return_time] == 1
    r = Registration.update params[:id], params[:registration]
---
UPDATE `registrations` SET `checkin_time` = '2000-01-01 04:59:06' WHERE `registrations`.`registration_id` = 94751